update docs with mkdocs style
